app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis"
---
	def index
		@wikis = Wiki.all

SELECT "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("body", "created_at", "private", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "jdgsljdgksd"], ["created_at", Tue, 10 Dec 2013 19:09:22 UTC +00:00], ["private", true], ["title", "Second Wiki"], ["updated_at", Tue, 10 Dec 2013 19:09:22 UTC +00:00], ["user_id", 4]]
---
	def create
		@wiki = current_user.wikis.build(params[:wiki])
		if @wiki.save